ranjithaguna/pv/LED_Demo/source/pic32cx/component/peci.h
/**
 * \brief Component description for PIC32CX/0525SG12 PECI
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_PECI_COMPONENT_H_
#define _PIC32CX_0525SG12_PECI_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_PECI The PECI Interface allows the EC to retrieve temperature readings from PECI-compliant devices.
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PECI */
/* ========================================================================== */

/* -------- PECI_WRITE_DATA : (PECI Offset: 0x00) (R/W 8) The Write Data Register provides access to a 32-byte Transmit FIFO. -------- */

typedef union
{
  uint8_t  w;
} __PECI_WRITE_DATA_bits_t;
#define PECI_WRITE_DATA_RESETVALUE          (0x00U)                                       /**<  (PECI_WRITE_DATA) The Write Data Register provides access to a 32-byte Transmit FIFO.  Reset Value */

#define PECI_WRITE_DATA_Msk                   (0x00000000UL)                                 /**< (PECI_WRITE_DATA) Register Mask  */

/* -------- PECI_READ_DATA : (PECI Offset: 0x04) (R/W 8) The Read Data Register provides access to a 32-byte Receive FIFO. -------- */

typedef union
{
  uint8_t  w;
} __PECI_READ_DATA_bits_t;
#define PECI_READ_DATA_RESETVALUE           (0x00U)                                       /**<  (PECI_READ_DATA) The Read Data Register provides access to a 32-byte Receive FIFO.  Reset Value */

#define PECI_READ_DATA_Msk                    (0x00000000UL)                                 /**< (PECI_READ_DATA) Register Mask  */

/* -------- PECI_CONTROL : (PECI Offset: 0x08) (R/W 8) Control Register -------- */

typedef union
{
  struct
  {
    uint8_t  PD:1;                      /**< bit:      0  PD (Power Down) along with RST controls the Power Management Interface */
    uint8_t  :2;                        /**< bit:   1..2  Reserved                                      */
    uint8_t  RST:1;                     /**< bit:      3  RST indicates that the PECI Core should be reset. */
    uint8_t  :1;                        /**< bit:      4  Reserved                                      */
    uint8_t  FRST:1;                    /**< bit:      5  FRST is the FIFO Reset bit.                   */
    uint8_t  TXEN:1;                    /**< bit:      6  TXEN is the Transmit Enable bit.              */
    uint8_t  MIEN:1;                    /**< bit:      7  MIEN is the Master Interrupt Enable           */
  };
  uint8_t  w;
} __PECI_CONTROL_bits_t;
#define PECI_CONTROL_RESETVALUE             (0x01U)                                       /**<  (PECI_CONTROL) Control Register  Reset Value */

#define PECI_CONTROL_PD_Pos                   (0)                                            /**< (PECI_CONTROL) PD (Power Down) along with RST controls the Power Management Interface Position */
#define PECI_CONTROL_PD_Msk                   (0x1U << PECI_CONTROL_PD_Pos)                  /**< (PECI_CONTROL) PD (Power Down) along with RST controls the Power Management Interface Mask */
#define PECI_CONTROL_RST_Pos                  (3)                                            /**< (PECI_CONTROL) RST indicates that the PECI Core should be reset. Position */
#define PECI_CONTROL_RST_Msk                  (0x1U << PECI_CONTROL_RST_Pos)                 /**< (PECI_CONTROL) RST indicates that the PECI Core should be reset. Mask */
#define PECI_CONTROL_FRST_Pos                 (5)                                            /**< (PECI_CONTROL) FRST is the FIFO Reset bit. Position */
#define PECI_CONTROL_FRST_Msk                 (0x1U << PECI_CONTROL_FRST_Pos)                /**< (PECI_CONTROL) FRST is the FIFO Reset bit. Mask */
#define PECI_CONTROL_TXEN_Pos                 (6)                                            /**< (PECI_CONTROL) TXEN is the Transmit Enable bit. Position */
#define PECI_CONTROL_TXEN_Msk                 (0x1U << PECI_CONTROL_TXEN_Pos)                /**< (PECI_CONTROL) TXEN is the Transmit Enable bit. Mask */
#define PECI_CONTROL_MIEN_Pos                 (7)                                            /**< (PECI_CONTROL) MIEN is the Master Interrupt Enable Position */
#define PECI_CONTROL_MIEN_Msk                 (0x1U << PECI_CONTROL_MIEN_Pos)                /**< (PECI_CONTROL) MIEN is the Master Interrupt Enable Mask */
#define PECI_CONTROL_Msk                      (0x000000E9UL)                                 /**< (PECI_CONTROL) Register Mask  */

/* -------- PECI_STATUS1 : (PECI Offset: 0x0c) (R/W 8) Status Register 1 -------- */

typedef union
{
  struct
  {
    uint8_t  BOF:1;                     /**< bit:      0  BOF (Beginning of Frame) is asserted when the PECI Core begins Address Timing Negotiation. (R/WC) */
    uint8_t  EOF:1;                     /**< bit:      1  EOF (End of Frame) is asserted following Message Stop (tSTOP). (R/WC) */
    uint8_t  ERR:1;                     /**< bit:      2  ERR Indicates that an error for the current transaction has been detected. */
    uint8_t  RDY:1;                     /**< bit:      3  RDY represents the state of the READY signal function */
    uint8_t  RDYLO:1;                   /**< bit:      4  RDYLO is asserted '1' on the falling edge of the READY signal function (R/WC) */
    uint8_t  RDYHI:1;                   /**< bit:      5  RDYHI is asserted '1' on the rising edge of the READY signal function (R/WC) */
    uint8_t  :1;                        /**< bit:      6  Reserved                                      */
    uint8_t  MINT:1;                    /**< bit:      7  MINT is the Master Interrupt Status bit and is asserted when any interrupt status bit in the Interrupt Interface is asserted. */
  };
  uint8_t  w;
} __PECI_STATUS1_bits_t;
