ranjithaguna/pv/LED_Demo/source/pic32cx/component/peci.h
#define PECI_STATUS1_RESETVALUE             (0x00U)                                       /**<  (PECI_STATUS1) Status Register 1  Reset Value */

#define PECI_STATUS1_BOF_Pos                  (0)                                            /**< (PECI_STATUS1) BOF (Beginning of Frame) is asserted when the PECI Core begins Address Timing Negotiation. (R/WC) Position */
#define PECI_STATUS1_BOF_Msk                  (0x1U << PECI_STATUS1_BOF_Pos)                 /**< (PECI_STATUS1) BOF (Beginning of Frame) is asserted when the PECI Core begins Address Timing Negotiation. (R/WC) Mask */
#define PECI_STATUS1_EOF_Pos                  (1)                                            /**< (PECI_STATUS1) EOF (End of Frame) is asserted following Message Stop (tSTOP). (R/WC) Position */
#define PECI_STATUS1_EOF_Msk                  (0x1U << PECI_STATUS1_EOF_Pos)                 /**< (PECI_STATUS1) EOF (End of Frame) is asserted following Message Stop (tSTOP). (R/WC) Mask */
#define PECI_STATUS1_ERR_Pos                  (2)                                            /**< (PECI_STATUS1) ERR Indicates that an error for the current transaction has been detected. Position */
#define PECI_STATUS1_ERR_Msk                  (0x1U << PECI_STATUS1_ERR_Pos)                 /**< (PECI_STATUS1) ERR Indicates that an error for the current transaction has been detected. Mask */
#define PECI_STATUS1_RDY_Pos                  (3)                                            /**< (PECI_STATUS1) RDY represents the state of the READY signal function Position */
#define PECI_STATUS1_RDY_Msk                  (0x1U << PECI_STATUS1_RDY_Pos)                 /**< (PECI_STATUS1) RDY represents the state of the READY signal function Mask */
#define PECI_STATUS1_RDYLO_Pos                (4)                                            /**< (PECI_STATUS1) RDYLO is asserted '1' on the falling edge of the READY signal function (R/WC) Position */
#define PECI_STATUS1_RDYLO_Msk                (0x1U << PECI_STATUS1_RDYLO_Pos)               /**< (PECI_STATUS1) RDYLO is asserted '1' on the falling edge of the READY signal function (R/WC) Mask */
#define PECI_STATUS1_RDYHI_Pos                (5)                                            /**< (PECI_STATUS1) RDYHI is asserted '1' on the rising edge of the READY signal function (R/WC) Position */
#define PECI_STATUS1_RDYHI_Msk                (0x1U << PECI_STATUS1_RDYHI_Pos)               /**< (PECI_STATUS1) RDYHI is asserted '1' on the rising edge of the READY signal function (R/WC) Mask */
#define PECI_STATUS1_MINT_Pos                 (7)                                            /**< (PECI_STATUS1) MINT is the Master Interrupt Status bit and is asserted when any interrupt status bit in the Interrupt Interface is asserted. Position */
#define PECI_STATUS1_MINT_Msk                 (0x1U << PECI_STATUS1_MINT_Pos)                /**< (PECI_STATUS1) MINT is the Master Interrupt Status bit and is asserted when any interrupt status bit in the Interrupt Interface is asserted. Mask */
#define PECI_STATUS1_Msk                      (0x000000BFUL)                                 /**< (PECI_STATUS1) Register Mask  */

/* -------- PECI_STATUS2 : (PECI Offset: 0x10) (R/ 8) Status Register 2 -------- */

typedef union
{
  struct
  {
    uint8_t  WFF:1;                     /**< bit:      0  WFF indicates that the Write Data Register FIFO is full. WFF does not generate an interrupt. */
    uint8_t  WFE:1;                     /**< bit:      1  WFE indicates that the Write Data Register FIFO is empty. */
    uint8_t  RFF:1;                     /**< bit:      2  RFF indicates that the Read Data Register FIFO is full. */
    uint8_t  RFE:1;                     /**< bit:      3  RFE indicates that the Read Data Register FIFO is empty. RFE does not generate an interrupt. */
    uint8_t  :3;                        /**< bit:   4..6  Reserved                                      */
    uint8_t  IDLE:1;                    /**< bit:      7  The IDLE status bit indicates when the SST/PECI bus is idle and a new transaction may begin. */
  };
  uint8_t  w;
} __PECI_STATUS2_bits_t;
#define PECI_STATUS2_RESETVALUE             (0x0AU)                                       /**<  (PECI_STATUS2) Status Register 2  Reset Value */

#define PECI_STATUS2_WFF_Pos                  (0)                                            /**< (PECI_STATUS2) WFF indicates that the Write Data Register FIFO is full. WFF does not generate an interrupt. Position */
#define PECI_STATUS2_WFF_Msk                  (0x1U << PECI_STATUS2_WFF_Pos)                 /**< (PECI_STATUS2) WFF indicates that the Write Data Register FIFO is full. WFF does not generate an interrupt. Mask */
#define PECI_STATUS2_WFE_Pos                  (1)                                            /**< (PECI_STATUS2) WFE indicates that the Write Data Register FIFO is empty. Position */
#define PECI_STATUS2_WFE_Msk                  (0x1U << PECI_STATUS2_WFE_Pos)                 /**< (PECI_STATUS2) WFE indicates that the Write Data Register FIFO is empty. Mask */
#define PECI_STATUS2_RFF_Pos                  (2)                                            /**< (PECI_STATUS2) RFF indicates that the Read Data Register FIFO is full. Position */
#define PECI_STATUS2_RFF_Msk                  (0x1U << PECI_STATUS2_RFF_Pos)                 /**< (PECI_STATUS2) RFF indicates that the Read Data Register FIFO is full. Mask */
#define PECI_STATUS2_RFE_Pos                  (3)                                            /**< (PECI_STATUS2) RFE indicates that the Read Data Register FIFO is empty. RFE does not generate an interrupt. Position */
#define PECI_STATUS2_RFE_Msk                  (0x1U << PECI_STATUS2_RFE_Pos)                 /**< (PECI_STATUS2) RFE indicates that the Read Data Register FIFO is empty. RFE does not generate an interrupt. Mask */
#define PECI_STATUS2_IDLE_Pos                 (7)                                            /**< (PECI_STATUS2) The IDLE status bit indicates when the SST/PECI bus is idle and a new transaction may begin. Position */
#define PECI_STATUS2_IDLE_Msk                 (0x1U << PECI_STATUS2_IDLE_Pos)                /**< (PECI_STATUS2) The IDLE status bit indicates when the SST/PECI bus is idle and a new transaction may begin. Mask */
#define PECI_STATUS2_Msk                      (0x0000008FUL)                                 /**< (PECI_STATUS2) Register Mask  */

