ranjithaguna/pv/LED_Demo/source/pic32cx/component/peci.h
/* -------- PECI_ERROR : (PECI Offset: 0x14) (R/W 8) Error Register -------- */

typedef union
{
  struct
  {
    uint8_t  FERR:1;                    /**< bit:      0  FERR (Frame Check Sequence Error). (R/WC)     */
    uint8_t  BERR:1;                    /**< bit:      1  BERR (Bus Error). Bus contention has been detected. BERR is asserted when the PECI Module reads a value that is different from what it has driven (R/WC) */
    uint8_t  :1;                        /**< bit:      2  Reserved                                      */
    uint8_t  REQERR:1;                  /**< bit:      3  REQERR is asserted if PEC_AVAILABLE (READY) input is not asserted when the counts down to zero as shown in. When asserted, REQERR can generate interrupt. (R/WC) */
    uint8_t  WROV:1;                    /**< bit:      4  WROV (Write Overrun). (R/WC)                  */
    uint8_t  WRUN:1;                    /**< bit:      5  WRUN (Write Underrun). (R/WC)                 */
    uint8_t  RDOV:1;                    /**< bit:      6  RDOV (Read Overrun). RDOV indicates that the internal read buffer has overflowed (R/WC) */
    uint8_t  CLKERR:1;                  /**< bit:      7  CLKERR indicates that the READY signal function in the Hardware Interface was de-asserted in the middle of a transaction (R/WC) */
  };
  uint8_t  w;
} __PECI_ERROR_bits_t;
#define PECI_ERROR_RESETVALUE               (0x00U)                                       /**<  (PECI_ERROR) Error Register  Reset Value */

#define PECI_ERROR_FERR_Pos                   (0)                                            /**< (PECI_ERROR) FERR (Frame Check Sequence Error). (R/WC) Position */
#define PECI_ERROR_FERR_Msk                   (0x1U << PECI_ERROR_FERR_Pos)                  /**< (PECI_ERROR) FERR (Frame Check Sequence Error). (R/WC) Mask */
#define PECI_ERROR_BERR_Pos                   (1)                                            /**< (PECI_ERROR) BERR (Bus Error). Bus contention has been detected. BERR is asserted when the PECI Module reads a value that is different from what it has driven (R/WC) Position */
#define PECI_ERROR_BERR_Msk                   (0x1U << PECI_ERROR_BERR_Pos)                  /**< (PECI_ERROR) BERR (Bus Error). Bus contention has been detected. BERR is asserted when the PECI Module reads a value that is different from what it has driven (R/WC) Mask */
#define PECI_ERROR_REQERR_Pos                 (3)                                            /**< (PECI_ERROR) REQERR is asserted if PEC_AVAILABLE (READY) input is not asserted when the counts down to zero as shown in. When asserted, REQERR can generate interrupt. (R/WC) Position */
#define PECI_ERROR_REQERR_Msk                 (0x1U << PECI_ERROR_REQERR_Pos)                /**< (PECI_ERROR) REQERR is asserted if PEC_AVAILABLE (READY) input is not asserted when the counts down to zero as shown in. When asserted, REQERR can generate interrupt. (R/WC) Mask */
#define PECI_ERROR_WROV_Pos                   (4)                                            /**< (PECI_ERROR) WROV (Write Overrun). (R/WC) Position */
#define PECI_ERROR_WROV_Msk                   (0x1U << PECI_ERROR_WROV_Pos)                  /**< (PECI_ERROR) WROV (Write Overrun). (R/WC) Mask */
#define PECI_ERROR_WRUN_Pos                   (5)                                            /**< (PECI_ERROR) WRUN (Write Underrun). (R/WC) Position */
#define PECI_ERROR_WRUN_Msk                   (0x1U << PECI_ERROR_WRUN_Pos)                  /**< (PECI_ERROR) WRUN (Write Underrun). (R/WC) Mask */
#define PECI_ERROR_RDOV_Pos                   (6)                                            /**< (PECI_ERROR) RDOV (Read Overrun). RDOV indicates that the internal read buffer has overflowed (R/WC) Position */
#define PECI_ERROR_RDOV_Msk                   (0x1U << PECI_ERROR_RDOV_Pos)                  /**< (PECI_ERROR) RDOV (Read Overrun). RDOV indicates that the internal read buffer has overflowed (R/WC) Mask */
#define PECI_ERROR_CLKERR_Pos                 (7)                                            /**< (PECI_ERROR) CLKERR indicates that the READY signal function in the Hardware Interface was de-asserted in the middle of a transaction (R/WC) Position */
#define PECI_ERROR_CLKERR_Msk                 (0x1U << PECI_ERROR_CLKERR_Pos)                /**< (PECI_ERROR) CLKERR indicates that the READY signal function in the Hardware Interface was de-asserted in the middle of a transaction (R/WC) Mask */
#define PECI_ERROR_Msk                        (0x000000FBUL)                                 /**< (PECI_ERROR) Register Mask  */

/* -------- PECI_INT_EN1 : (PECI Offset: 0x18) (R/W 8) Interrupt Enable 1 Register -------- */

typedef union
{
  struct
  {
    uint8_t  BIEN:1;                    /**< bit:      0  When the BIEN bit is asserted '1' the BOF interrupt is enabled. */
    uint8_t  EIEN:1;                    /**< bit:      1  When the EIEN bit is asserted '1' the EOF interrupt is enabled. */
    uint8_t  EREN:1;                    /**< bit:      2  When the EREN bit is asserted '1' the ERR interrupt is enabled. */
    uint8_t  :1;                        /**< bit:      3  Reserved                                      */
    uint8_t  RLEN:1;                    /**< bit:      4  When the RLEN bit is asserted '1' the RDYLO interrupt is enabled. */
    uint8_t  RHEN:1;                    /**< bit:      5  When the RHEN bit is asserted '1' the RDYHI interrupt is enabled. */
    uint8_t  :2;                        /**< bit:   6..7  Reserved                                      */
  };
  uint8_t  w;
} __PECI_INT_EN1_bits_t;
#define PECI_INT_EN1_RESETVALUE             (0x00U)                                       /**<  (PECI_INT_EN1) Interrupt Enable 1 Register  Reset Value */

#define PECI_INT_EN1_BIEN_Pos                 (0)                                            /**< (PECI_INT_EN1) When the BIEN bit is asserted '1' the BOF interrupt is enabled. Position */
#define PECI_INT_EN1_BIEN_Msk                 (0x1U << PECI_INT_EN1_BIEN_Pos)                /**< (PECI_INT_EN1) When the BIEN bit is asserted '1' the BOF interrupt is enabled. Mask */
#define PECI_INT_EN1_EIEN_Pos                 (1)                                            /**< (PECI_INT_EN1) When the EIEN bit is asserted '1' the EOF interrupt is enabled. Position */
#define PECI_INT_EN1_EIEN_Msk                 (0x1U << PECI_INT_EN1_EIEN_Pos)                /**< (PECI_INT_EN1) When the EIEN bit is asserted '1' the EOF interrupt is enabled. Mask */
#define PECI_INT_EN1_EREN_Pos                 (2)                                            /**< (PECI_INT_EN1) When the EREN bit is asserted '1' the ERR interrupt is enabled. Position */
#define PECI_INT_EN1_EREN_Msk                 (0x1U << PECI_INT_EN1_EREN_Pos)                /**< (PECI_INT_EN1) When the EREN bit is asserted '1' the ERR interrupt is enabled. Mask */
#define PECI_INT_EN1_RLEN_Pos                 (4)                                            /**< (PECI_INT_EN1) When the RLEN bit is asserted '1' the RDYLO interrupt is enabled. Position */
#define PECI_INT_EN1_RLEN_Msk                 (0x1U << PECI_INT_EN1_RLEN_Pos)                /**< (PECI_INT_EN1) When the RLEN bit is asserted '1' the RDYLO interrupt is enabled. Mask */
#define PECI_INT_EN1_RHEN_Pos                 (5)                                            /**< (PECI_INT_EN1) When the RHEN bit is asserted '1' the RDYHI interrupt is enabled. Position */
#define PECI_INT_EN1_RHEN_Msk                 (0x1U << PECI_INT_EN1_RHEN_Pos)                /**< (PECI_INT_EN1) When the RHEN bit is asserted '1' the RDYHI interrupt is enabled. Mask */
#define PECI_INT_EN1_Msk                      (0x00000037UL)                                 /**< (PECI_INT_EN1) Register Mask  */

