ranjithaguna/pv/LED_Demo/source/pic32cx/component/peci.h
/* -------- PECI_INT_EN2 : (PECI Offset: 0x1c) (R/W 8) Interrupt Enable 2 Register -------- */

typedef union
{
  struct
  {
    uint8_t  :1;                        /**< bit:      0  Reserved                                      */
    uint8_t  ENWFE:1;                   /**< bit:      1  When the ENWFE bit is asserted '1' the WFE interrupt is enabled. */
    uint8_t  ENRFF:1;                   /**< bit:      2  When the ENRFF bit is asserted '1' the RFF interrupt is enabled. */
    uint8_t  :5;                        /**< bit:   3..7  Reserved                                      */
  };
  uint8_t  w;
} __PECI_INT_EN2_bits_t;
#define PECI_INT_EN2_RESETVALUE             (0x00U)                                       /**<  (PECI_INT_EN2) Interrupt Enable 2 Register  Reset Value */

#define PECI_INT_EN2_ENWFE_Pos                (1)                                            /**< (PECI_INT_EN2) When the ENWFE bit is asserted '1' the WFE interrupt is enabled. Position */
#define PECI_INT_EN2_ENWFE_Msk                (0x1U << PECI_INT_EN2_ENWFE_Pos)               /**< (PECI_INT_EN2) When the ENWFE bit is asserted '1' the WFE interrupt is enabled. Mask */
#define PECI_INT_EN2_ENRFF_Pos                (2)                                            /**< (PECI_INT_EN2) When the ENRFF bit is asserted '1' the RFF interrupt is enabled. Position */
#define PECI_INT_EN2_ENRFF_Msk                (0x1U << PECI_INT_EN2_ENRFF_Pos)               /**< (PECI_INT_EN2) When the ENRFF bit is asserted '1' the RFF interrupt is enabled. Mask */
#define PECI_INT_EN2_Msk                      (0x00000006UL)                                 /**< (PECI_INT_EN2) Register Mask  */

/* -------- PECI_OBT1 : (PECI Offset: 0x20) (R/W 8) Optimal Bit Time Register (Low Byte) -------- */

typedef union
{
  uint8_t  w;
} __PECI_OBT1_bits_t;
#define PECI_OBT1_RESETVALUE                (0x16U)                                       /**<  (PECI_OBT1) Optimal Bit Time Register (Low Byte)  Reset Value */

#define PECI_OBT1_Msk                         (0x00000000UL)                                 /**< (PECI_OBT1) Register Mask  */

/* -------- PECI_OBT2 : (PECI Offset: 0x24) (R/W 8) Optimal Bit Time Register (High Byte) -------- */

typedef union
{
  uint8_t  w;
} __PECI_OBT2_bits_t;
#define PECI_OBT2_RESETVALUE                (0x00U)                                       /**<  (PECI_OBT2) Optimal Bit Time Register (High Byte)  Reset Value */

#define PECI_OBT2_Msk                         (0x00000000UL)                                 /**< (PECI_OBT2) Register Mask  */

/* -------- PECI_BAUD_CTRL : (PECI Offset: 0x30) (R/W 32) Baud Control Register.\n     The baud div value divides down the sytem clock frequency to create the peci CORE_CLK frequency.\n -------- */

typedef union
{
  uint32_t w;
} __PECI_BAUD_CTRL_bits_t;
#define PECI_BAUD_CTRL_RESETVALUE           (0x06U)                                       /**<  (PECI_BAUD_CTRL) Baud Control Register.\n     The baud div value divides down the sytem clock frequency to create the peci CORE_CLK frequency.\n  Reset Value */

#define PECI_BAUD_CTRL_Msk                    (0x00000000UL)                                 /**< (PECI_BAUD_CTRL) Register Mask  */

/* -------- PECI_ID : (PECI Offset: 0x40) (R/W 32) Block ID Register -------- */

typedef union
{
  uint32_t w;
} __PECI_ID_bits_t;
#define PECI_ID_RESETVALUE                  (0x0FU)                                       /**<  (PECI_ID) Block ID Register  Reset Value */

#define PECI_ID_Msk                           (0x00000000UL)                                 /**< (PECI_ID) Register Mask  */

/* -------- PECI_REV : (PECI Offset: 0x44) (R/W 32) Revision Register -------- */

typedef union
{
  uint32_t w;
} __PECI_REV_bits_t;
#define PECI_REV_RESETVALUE                 (0x0FU)                                       /**<  (PECI_REV) Revision Register  Reset Value */

#define PECI_REV_Msk                          (0x00000000UL)                                 /**< (PECI_REV) Register Mask  */

/** \brief PECI register offsets definitions */
#define PECI_WRITE_DATA_OFFSET       (0x00)         /**< (PECI_WRITE_DATA) The Write Data Register provides access to a 32-byte Transmit FIFO. Offset */
#define PECI_READ_DATA_OFFSET        (0x04)         /**< (PECI_READ_DATA) The Read Data Register provides access to a 32-byte Receive FIFO. Offset */
#define PECI_CONTROL_OFFSET          (0x08)         /**< (PECI_CONTROL) Control Register Offset */
#define PECI_STATUS1_OFFSET          (0x0C)         /**< (PECI_STATUS1) Status Register 1 Offset */
#define PECI_STATUS2_OFFSET          (0x10)         /**< (PECI_STATUS2) Status Register 2 Offset */
#define PECI_ERROR_OFFSET            (0x14)         /**< (PECI_ERROR) Error Register Offset */
#define PECI_INT_EN1_OFFSET          (0x18)         /**< (PECI_INT_EN1) Interrupt Enable 1 Register Offset */
#define PECI_INT_EN2_OFFSET          (0x1C)         /**< (PECI_INT_EN2) Interrupt Enable 2 Register Offset */
#define PECI_OBT1_OFFSET             (0x20)         /**< (PECI_OBT1) Optimal Bit Time Register (Low Byte) Offset */
#define PECI_OBT2_OFFSET             (0x24)         /**< (PECI_OBT2) Optimal Bit Time Register (High Byte) Offset */
#define PECI_BAUD_CTRL_OFFSET        (0x30)         /**< (PECI_BAUD_CTRL) Baud Control Register.\n     The baud div value divides down the sytem clock frequency to create the peci CORE_CLK frequency.\n Offset */
#define PECI_ID_OFFSET               (0x40)         /**< (PECI_ID) Block ID Register Offset */
#define PECI_REV_OFFSET              (0x44)         /**< (PECI_REV) Revision Register Offset */

/** \brief PECI register API structure */
typedef struct
{  /* The PECI Interface allows the EC to retrieve temperature readings from PECI-compliant devices. */
  __IO  __PECI_WRITE_DATA_bits_t       WRITE_DATA;    /**< Offset: 0x00 (R/W   8) The Write Data Register provides access to a 32-byte Transmit FIFO. */
  __IO  __PECI_READ_DATA_bits_t        READ_DATA;     /**< Offset: 0x04 (R/W   8) The Read Data Register provides access to a 32-byte Receive FIFO. */
  __IO  __PECI_CONTROL_bits_t          CONTROL;       /**< Offset: 0x08 (R/W   8) Control Register */
  __IO  __PECI_STATUS1_bits_t          STATUS1;       /**< Offset: 0x0C (R/W   8) Status Register 1 */
  __I   __PECI_STATUS2_bits_t          STATUS2;       /**< Offset: 0x10 (R/    8) Status Register 2 */
  __IO  __PECI_ERROR_bits_t            ERROR;         /**< Offset: 0x14 (R/W   8) Error Register */
  __IO  __PECI_INT_EN1_bits_t          INT_EN1;       /**< Offset: 0x18 (R/W   8) Interrupt Enable 1 Register */
  __IO  __PECI_INT_EN2_bits_t          INT_EN2;       /**< Offset: 0x1C (R/W   8) Interrupt Enable 2 Register */
  __IO  __PECI_OBT1_bits_t             OBT1;          /**< Offset: 0x20 (R/W   8) Optimal Bit Time Register (Low Byte) */
  __IO  __PECI_OBT2_bits_t             OBT2;          /**< Offset: 0x24 (R/W   8) Optimal Bit Time Register (High Byte) */
  __IO  __PECI_BAUD_CTRL_bits_t        BAUD_CTRL;     /**< Offset: 0x30 (R/W  32) Baud Control Register.\n     The baud div value divides down the sytem clock frequency to create the peci CORE_CLK frequency.\n */
  __IO  __PECI_ID_bits_t               ID;            /**< Offset: 0x40 (R/W  32) Block ID Register */
  __IO  __PECI_REV_bits_t              REV;           /**< Offset: 0x44 (R/W  32) Revision Register */
} peci_registers_t;
/** @}  end of The PECI Interface allows the EC to retrieve temperature readings from PECI-compliant devices. */

#endif /* _PIC32CX_0525SG12_PECI_COMPONENT_H_ */
